data/SOAP/req10.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <ns3:echoBase64 xmlns:ns3="http://soapinterop.org/">
   <inputBase64 xsi:type="xsd:base64Binary">QmFzZTY0</inputBase64>
  </ns3:echoBase64>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
