data/SOAP/req1.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <ns3:echoString xmlns:ns3="http://soapinterop.org/">
   <inputString xsi:type="xsd:string">abcdefg</inputString>
  </ns3:echoString>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
